### Imports

In [74]:
import pandas as pd
import glob
import os

### Opening DFs

In [75]:
# ADI
df_adi = pd.read_csv('D:/UCLA/Capstone/HMS-MGH-Capstone-Project/datasets/ADI/US_2020_ADI_Census Block Group_v4.csv')
df_adi.head()

   Unnamed: 0  X.1  X          GISJOIN ADI_NATRANK ADI_STATERNK         FIPS
0           1    1  1  G01000100201001          66            4  10010201001
1           2    2  2  G01000100201002          66            4  10010201002
2           3    3  3  G01000100202001          88            7  10010202001
3           4    4  4  G01000100202002          88            7  10010202002
4           5    5  5  G01000100203001          75            5  10010203001

In [76]:
# AHD AK to IA

all_ahd_files = glob.glob('D:/UCLA/Capstone/HMS-MGH-Capstone-Project/datasets/AHD_Data/AK_to_IA/' + "*.csv")
all_ahd_files = [f.replace("\\", "/") for f in all_ahd_files]

ahd_AK_to_IA_dfs = []
for filename in all_ahd_files:
    df = pd.read_csv(filename)
    ahd_AK_to_IA_dfs.append(df)

ahd_AK_to_IA_dfs[0].head()

,Unnamed: 0,State,Hospital_Name,City,Staffed_Beds,Total_Discharges,Patient_Days,Gross_Patient_Revenue
0,0,AK,673d Medical Group - Joint Base Elmendorf-Rich...,Joint Base Elmendorf-Richardson,0,0,0,$0
1,1,AK,Alaska Native Medical Center,Anchorage,174,"8,079","40,053",$0
2,2,AK,Alaska Regional Hospital,Anchorage,176,"7,205","42,868","$1,749,027"
3,3,AK,Bartlett Regional Hospital,Juneau,57,"1,506","8,091","$212,228"
4,4,AK,Bassett Army Community Hospital,Fort Wainwright,0,0,0,$0

In [77]:
# AHD ID to MP

all_ahd_files = glob.glob('D:/UCLA/Capstone/HMS-MGH-Capstone-Project/datasets/AHD_Data/ID_to_MP/' + "*.csv")
all_ahd_files = [f.replace("\\", "/") for f in all_ahd_files]

ahd_ID_to_MP_dfs = []
for filename in all_ahd_files:
    df = pd.read_csv(filename)
    ahd_ID_to_MP_dfs.append(df)

ahd_ID_to_MP_dfs[0].head()

,Unnamed: 0,State,Hospital_Name,City,Staffed_Beds,Total_Discharges,Patient_Days,Gross_Patient_Revenue
0,0,ID,Boise VA Medical Center,Boise,0,0,0,$0
1,1,ID,Eastern Idaho Regional Medical Center,Idaho Falls,290,"9,278","53,648","$1,716,791"
2,2,ID,Grove Creek Medical Center,Blackfoot,8,396,"1,474","$6,436"
3,3,ID,Idaho Falls Community Hospital,Idaho Falls,88,"2,110","10,066","$219,528"
4,4,ID,Kootenai Health,Coeur d'Alene,329,"14,813","88,949","$1,660,832"

In [78]:
# AHD MS to PA

all_ahd_files = glob.glob('D:/UCLA/Capstone/HMS-MGH-Capstone-Project/datasets/AHD_Data/MS_to_PA/' + "*.csv")
all_ahd_files = [f.replace("\\", "/") for f in all_ahd_files]

ahd_MS_to_PA_dfs = []
for filename in all_ahd_files:
    df = pd.read_csv(filename)
    ahd_MS_to_PA_dfs.append(df)

ahd_MS_to_PA_dfs[0].head()

,Unnamed: 0,State,Hospital_Name,City,Staffed_Beds,Total_Discharges,Patient_Days,Gross_Patient_Revenue
0,0,MS,81st Medical Group - Keesler Medical Center,Keesler Air Force Base,0,0,0,$0
1,1,MS,Alliance Health Center,Meridian,154,912,"5,585","$82,038"
2,2,MS,Alliance Healthcare Hospital,Holly Springs,0,0,0,$0
3,3,MS,Anderson Regional Medical Center,Meridian,270,"8,003","37,979","$761,876"
4,4,MS,Anderson Regional Medical Center South,Meridian,69,1,1,"$53,840"

In [79]:
# AHD PR to WY

all_ahd_files = glob.glob('D:/UCLA/Capstone/HMS-MGH-Capstone-Project/datasets/AHD_Data/PR_to_WY/' + "*.csv")
all_ahd_files = [f.replace("\\", "/") for f in all_ahd_files]

ahd_PR_to_WY_dfs = []
for filename in all_ahd_files:
    df = pd.read_csv(filename)
    ahd_PR_to_WY_dfs.append(df)

ahd_PR_to_WY_dfs[0].head()

,Unnamed: 0,State,Hospital_Name,City,Staffed_Beds,Total_Discharges,Patient_Days,Gross_Patient_Revenue
0,0,PR,Ashford Hospital,San Juan,173,"7,683","40,742","$93,840"
1,1,PR,Auxilio Mutuo Hospital of Puerto Rico,Hato Rey,500,"14,306","93,369","$401,601"
2,2,PR,Bayamon Medical Center,Bayamon,253,"8,584","44,862","$107,124"
3,3,PR,Bayamon Regional Hospital,Bayamon,140,"1,578","38,279","$11,576"
4,4,PR,Bella Vista Hospital,Mayaguez,183,"3,689","19,436","$68,775"

In [80]:
# State Covid Cases
df_cases = pd.read_csv('D:/UCLA/Capstone/HMS-MGH-Capstone-Project/datasets/covid_data/us_state_confirmed_case.csv')
df_cases.head()

,Right_STATE,state,POP90,POP80,POP70,POP10,POP00,NAME,HHD90,HHD80,...,2023-03-14,2023-03-15,2023-03-16,2023-03-17,2023-03-18,2023-03-19,2023-03-20,2023-03-21,2023-03-22,2023-03-23
0,1,Alabama,4040576,3886040,3434507,4779736,4447059,Alabama,1506778,1340563,...,1644533,1646423,1646423,1646423,1646423,1646423,1646423,1646423,1648385,1648385
1,2,Alaska,549808,393155,225211,710231,626932,Alaska,188909,130004,...,308399,308399,308399,308399,308399,308399,308399,308893,308893,308893
2,4,Arizona,3663266,2705322,1768275,6392017,5130674,Arizona,1368775,953006,...,2444144,2448406,2448406,2448406,2448406,2448406,2448406,2448406,2451062,2451062
3,5,Arkansas,2350107,2253450,1901082,2915918,2673393,Arkansas,891049,805730,...,1007474,1007474,1007940,1008303,1008303,1008303,1008303,1008303,1008303,1008303
4,6,California,29724503,23575384,19838084,37253956,33871650,California,10377409,8624938,...,12135588,12136243,12152129,12153079,12153079,12153083,12154293,12154941,12155467,12169158

In [81]:
# State Covid Deaths
df_deaths = pd.read_csv('D:/UCLA/Capstone/HMS-MGH-Capstone-Project/datasets/covid_data/us_state_confirmed_deaths.csv')
df_deaths.head()

,Right_STATE,state,POP90,POP80,POP70,POP10,POP00,NAME,HHD90,HHD80,...,2023-03-14,2023-03-15,2023-03-16,2023-03-17,2023-03-18,2023-03-19,2023-03-20,2023-03-21,2023-03-22,2023-03-23
0,1,Alabama,4040576,3886040,3434507,4779736,4447059,Alabama,1506778,1340563,...,21570,21612,21612,21612,21612,21612,21612,21612,21631,21631
1,2,Alaska,549808,393155,225211,710231,626932,Alaska,188909,130004,...,1438,1438,1438,1438,1438,1438,1438,1438,1438,1438
2,4,Arizona,3663266,2705322,1768275,6392017,5130674,Arizona,1368775,953006,...,33104,33158,33158,33158,33158,33158,33158,33158,33190,33190
3,5,Arkansas,2350107,2253450,1901082,2915918,2673393,Arkansas,891049,805730,...,13038,13038,13060,13068,13068,13068,13068,13068,13068,13068
4,6,California,29724503,23575384,19838084,37253956,33871650,California,10377409,8624938,...,104038,104047,104114,104130,104130,104130,104165,104185,104196,104277

### Merging DFs

In [82]:
df_deaths_cases = df_cases.merge(df_deaths, on='state', how='inner')
df_deaths_cases.head()

,Right_STATE_x,state,POP90_x,POP80_x,POP70_x,POP10_x,POP00_x,NAME_x,HHD90_x,HHD80_x,...,2023-03-14_y,2023-03-15_y,2023-03-16_y,2023-03-17_y,2023-03-18_y,2023-03-19_y,2023-03-20_y,2023-03-21_y,2023-03-22_y,2023-03-23_y
0,1,Alabama,4040576,3886040,3434507,4779736,4447059,Alabama,1506778,1340563,...,21570,21612,21612,21612,21612,21612,21612,21612,21631,21631
1,2,Alaska,549808,393155,225211,710231,626932,Alaska,188909,130004,...,1438,1438,1438,1438,1438,1438,1438,1438,1438,1438
2,4,Arizona,3663266,2705322,1768275,6392017,5130674,Arizona,1368775,953006,...,33104,33158,33158,33158,33158,33158,33158,33158,33190,33190
3,5,Arkansas,2350107,2253450,1901082,2915918,2673393,Arkansas,891049,805730,...,13038,13038,13060,13068,13068,13068,13068,13068,13068,13068
4,6,California,29724503,23575384,19838084,37253956,33871650,California,10377409,8624938,...,104038,104047,104114,104130,104130,104130,104165,104185,104196,104277

In [83]:
state_abbreviations = {
    'Alaska': 'AK',
    'Alabama': 'AL',
    'Arkansas': 'AR',
    'Arizona': 'AZ',
    'California': 'CA',
    'Colorado': 'CO',
    'Connecticut': 'CT',
    'District of Columbia': 'DC',
    'Delaware': 'DE',
    'Florida': 'FL',
    'Georgia': 'GA',
    'Hawaii': 'HI',
    'Iowa': 'IA',
    'Idaho': 'ID',
    'Illinois': 'IL',
    'Indiana': 'IN',
    'Kansas': 'KS',
    'Kentucky': 'KY',
    'Louisiana': 'LA',
    'Massachusetts': 'MA',
    'Maryland': 'MD',
    'Maine': 'ME',
    'Michigan': 'MI',
    'Minnesota': 'MN',
    'Missouri': 'MO',
    'Mississippi': 'MS',
    'Montana': 'MT',
    'North Carolina': 'NC',
    'North Dakota': 'ND',
    'Nebraska': 'NE',
    'New Hampshire': 'NH',
    'New Jersey': 'NJ',
    'New Mexico': 'NM',
    'Nevada': 'NV',
    'New York': 'NY',
    'Ohio': 'OH',
    'Oklahoma': 'OK',
    'Oregon': 'OR',
    'Pennsylvania': 'PA',
    'Puerto Rico': 'PR',
    'Rhode Island': 'RI',
    'South Carolina': 'SC',
    'South Dakota': 'SD',
    'Tennessee': 'TN',
    'Texas': 'TX',
    'Utah': 'UT',
    'Virginia': 'VA',
    'Vermont': 'VT',
    'Washington': 'WA',
    'Wisconsin': 'WI',
    'West Virginia': 'WV',
    'Wyoming': 'WY'
}

In [84]:
df_deaths_cases['State'] = df_deaths_cases['state'].map(state_abbreviations)

In [85]:
ahd_AK_to_IA_dfs[0]['State']

0     AK
1     AK
2     AK
3     AK
4     AK
5     AK
6     AK
7     AK
8     AK
9     AK
10    AK
Name: State, dtype: object

In [86]:
df_main = df_deaths_cases

In [87]:
# Concatenating the DataFrames within each list
ahd_AK_to_IA_dfs = pd.concat(ahd_AK_to_IA_dfs, ignore_index=True)
ahd_ID_to_MP_dfs = pd.concat(ahd_ID_to_MP_dfs, ignore_index=True)
ahd_MS_to_PA_dfs = pd.concat(ahd_MS_to_PA_dfs, ignore_index=True)
ahd_PR_to_WY_dfs = pd.concat(ahd_PR_to_WY_dfs, ignore_index=True)

# Concatenating the resulting DataFrames into one
ahd_df = pd.concat([ahd_AK_to_IA_dfs, ahd_ID_to_MP_dfs, ahd_MS_to_PA_dfs, ahd_PR_to_WY_dfs], ignore_index=True)

In [88]:
df_main = df_main.merge(ahd_df, on='State', how='inner')

In [91]:
df_main.head()

,Right_STATE_x,state,POP90_x,POP80_x,POP70_x,POP10_x,POP00_x,NAME_x,HHD90_x,HHD80_x,...,2023-03-22_y,2023-03-23_y,State,Unnamed: 0,Hospital_Name,City,Staffed_Beds,Total_Discharges,Patient_Days,Gross_Patient_Revenue
0,1,Alabama,4040576,3886040,3434507,4779736,4447059,Alabama,1506778,1340563,...,21631,21631,AL,0,Andalusia Health,Andalusia,83,"2,196","9,475","$296,507"
1,1,Alabama,4040576,3886040,3434507,4779736,4447059,Alabama,1506778,1340563,...,21631,21631,AL,1,Ascension Saint Vincent's Birmingham,Birmingham,401,"17,201","94,162","$2,334,190"
2,1,Alabama,4040576,3886040,3434507,4779736,4447059,Alabama,1506778,1340563,...,21631,21631,AL,2,Ascension Saint Vincent's Chilton,Clanton,26,652,"2,098","$150,890"
3,1,Alabama,4040576,3886040,3434507,4779736,4447059,Alabama,1506778,1340563,...,21631,21631,AL,3,Ascension Saint Vincent's St. Clair,Pell City,40,"1,975","10,004","$271,331"
4,1,Alabama,4040576,3886040,3434507,4779736,4447059,Alabama,1506778,1340563,...,21631,21631,AL,4,Ascension St. Vincent's East,Birmingham,311,"12,222","78,475","$1,324,754"

In [ ]:
df_main.to_csv('df_main.csv', index=False)